<a href="https://colab.research.google.com/github/Sereenamariyam/Python_assignment/blob/main/Case_Study_SQL_Questions.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Case Study on SQL

In [1]:
import sqlite3
import pandas as pd

In [2]:
def load_imdb_database(db_path):
  try:
    conn = sqlite3.connect(db_path)
    print("IMDB database loaded successfully.")
    return conn
  except sqlite3.Error as e:
    print(f"Error loading IMDB database: {e}")
    return None

In [3]:
db_path = "/imdb (1).db"
conn = load_imdb_database(db_path)

if conn:
  print("Connection successful")
  cursor = conn.cursor()

IMDB database loaded successfully.
Connection successful

## Following is the schema of the IMDB database. It lists all tables and their schemas.

In [4]:
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
tables = cursor.fetchall()

print("Database Schema:")
for table in tables:
    table_name = table[0]
    print(f"\nTable: {table_name}")

    cursor.execute(f"PRAGMA table_info({table_name});")
    schema = cursor.fetchall()

    print("Columns:")
    for column in schema:
        cid, name, dtype, notnull, dflt_value, pk = column
        print(f"  - {name} ({dtype}), NOT NULL: {bool(notnull)}, Default: {dflt_value}, Primary Key: {bool(pk)}")

Database Schema:

In [6]:
from google.colab import drive
drive.mount('/content/drive')

MessageError: Error: credential propagation was unsuccessful

# Write SQL queries for the following questions

## 1. Write query to list first 5 rows of Person table

In [ ]:
q1 = """ SELECT *
FROM Person
LIMIT 5;"""

In [ ]:
def q1_grader(q1):
  result = pd.read_sql_query(q1, conn)
  return result.shape == (5, 4)
print(q1_grader(q1))

True

## 2. Write query to select title, year and rating from Movie table

In [ ]:
q2 = """SELECT title, year, rating
FROM Movie;
"""

In [ ]:
def q2_grader(q2):
  result = pd.read_sql_query(q2, conn)
  return result.shape == (3473, 3) and result['title'][0]=='Mowgli'
print(q2_grader(q2))

True

\## 3. Write query to get title of first movie in movie table sorted by year in ascending order\

In [ ]:
q3 = """SELECT title
FROM Movie
ORDER BY year ASC
LIMIT 1;"""

In [ ]:
def q3_grader(q3):
  result = pd.read_sql_query(q3, conn)
  return result['title']=='Alam Ara'
print(q3_grader(q3))

0    True
Name: title, dtype: bool

## 4. Write query to get the very first year in which Devdas movie was released

In [ ]:
q4 = """SELECT MIN(year) AS year
FROM Movie
WHERE title = 'Devdas';"""

In [ ]:
def q4_grader(q4):
  result = pd.read_sql_query(q4, conn)
  return result['year']=='1936'
print(q4_grader(q4))

0    True
Name: year, dtype: bool

## 5. Write query to get the number of movies released in 2018

In [9]:
q5 = """SELECT COUNT(*)
FROM movie
WHERE year = 2018;"""

In [11]:
def q5_grader(q5):
  result = pd.read_sql_query(q5, conn)
  return result.iloc[0, 0] == 93
print(q5_grader(q5))

DatabaseError: Execution failed on sql 'SELECT COUNT(*)
FROM movie
WHERE year = 2018;': no such table: movie

## 6. Write query to get the title of the movie with most number of votes in 2012

In [12]:
q6 = """
SELECT title
FROM movies
WHERE year = 2012
ORDER BY votes DESC
LIMIT 1;
"""

In [ ]:
def q6_grader(q6):
  result = pd.read_sql_query(q6, conn)
  return result["title"]=="The Avengers"
print(q6_grader(q6))

0    True
Name: title, dtype: bool

## 7. Write SQL query to find all the unique movie titles released in 2018

In [13]:
q7 = """
SELECT DISTINCT title
FROM movies
WHERE year = 2018;
"""

In [ ]:
def q7_grader(q7):
  result = pd.read_sql_query(q7, conn)
  return result.shape==(93, 1)
print(q7_grader(q7))

True

## 8. Write SQL query to get total number of movies released between 2017 (inclusive) and 2018 (inclusive)

In [ ]:
q8 = """
SELECT COUNT(*)
FROM movies
WHERE year BETWEEN 2017 AND 2018;
"""

In [ ]:
def q8_grader(q8):
  result = pd.read_sql_query(q8, conn)
  return result.iloc[0, 0] == 211
print(q8_grader(q8))

True

## 9. Write SQL query to find the year in which maximum number of movies released

In [14]:
q9 = """
SELECT year
FROM movies
GROUP BY year
ORDER BY COUNT(*) DESC
LIMIT 1;
"""

In [ ]:
def q9_grader(q9):
  result = pd.read_sql_query(q9, conn)
  return result["year"][0]=="2005"
print(q9_grader(q9))

True

## 10. Write SQL query to find the title of the movie with rating>9.5 and number of votes > 90

In [15]:
q10 = """
SELECT title
FROM movies
WHERE rating > 9.5 AND votes > 90;
"""

In [ ]:
def q10_grader(q10):
  result = pd.read_sql_query(q10, conn)
  return result["title"][0]=="Man on Mission Fauladi"
print(q10_grader(q10))

True

## 11. Write SQL query to find the number of movies which has the word 'Dilwale' in their title

In [16]:
q11 = """
SELECT COUNT(*)
FROM movies
WHERE title LIKE '%Dilwale%';
"""

In [ ]:
def q11_grader(q11):
  result = pd.read_sql_query(q11, conn)
  return result.iloc[0, 0] == 4
print(q11_grader(q11))

True

## 12. Write nested SQL query to find the CID of country which produced most number of movies

In [17]:
q12 = """
SELECT cid
FROM movies
GROUP BY cid
ORDER BY COUNT(*) DESC
LIMIT 1;
"""

In [ ]:
def q12_grader(q12):
  result = pd.read_sql_query(q12, conn)
  return result.iloc[0]==2.0
print(q12_grader(q12))

CID    True
Name: 0, dtype: bool

## 13. Write nested SQL query to the country which produced most number of movies (use both Courty table and M_Country table)

In [18]:
q13 = """
SELECT cname
FROM Country
WHERE cid = (
  SELECT cid
  FROM M_Country
  GROUP BY cid
  ORDER BY COUNT(mid) DESC
  LIMIT 1
);
"""

In [ ]:
def q13_grader(q13):
  result = pd.read_sql_query(q13, conn)
  return result.iloc[0, 0] == "India"
print(q13_grader(q13))

True

## 14. Write SQL query to get the year and number of movies per year having number of movies per year is greater than 100

In [19]:
q14 = """
SELECT year, COUNT(*) AS movie_count
FROM movies
GROUP BY year
HAVING COUNT(*) > 100;
"""

In [ ]:
def q14_grader(q14):
  result = pd.read_sql_query(q14, conn)
  return result.shape==(13,2)
print(q14_grader(q14))

True

## 15. Write SQL query to get the Name and Language ID (LAID) corresponding to Malayalam language

In [20]:
q15 = """
SELECT Name, LAID
FROM Language
WHERE Name = 'Malayalam';
"""

In [ ]:
def q15_grader(q15):
  result = pd.read_sql_query(q15, conn)
  print(result)
  return result[["Name", "LAID"]].values.tolist() == [['Malayalam', 19]]
print(q15_grader(q15))

   index       Name  LAID
0     19  Malayalam    19
True

## 16. Write SQL query to do inner join with movie table and M_Language table with MID colums

In [21]:
q16 = """
SELECT *
FROM movies
INNER JOIN M_Language ON movies.mid = M_Language.mid;
"""

In [ ]:
def q16_grader(q16):
  result = pd.read_sql_query(q16, conn)
  return result
print(q16_grader(q16))

              title  year  LAID
0            Mowgli  2018     0
1     Ocean's Eight  2018     0
2       Tomb Raider  2018     0
3      The Avengers  2012     0
4           Tumbbad  2018     1
...             ...   ...   ...
3468    Allah-Rakha  1986     2
3469          Anari  1993     2
3470  Come December  2006     2
3471     Kala Jigar  1939     2
3472         Kanoon  1994     2

[3473 rows x 3 columns]

## 17. Write SQL query to list title, year and rating of malayalam movies in the database by doing an inner join with movie table and M_Language table with MID column, also assuming language ID of malayalam movies as 19

In [22]:
q17 = """
SELECT movies.title, movies.year, movies.rating
FROM movies
INNER JOIN M_Language ON movies.mid = M_Language.mid
WHERE M_Language.laid = 19;
"""

In [ ]:
def q17_grader(q17):
  result = pd.read_sql_query(q17, conn)
  return result.shape==(16,3)
print(q17_grader(q17))

True

In [ ]:
![ -f academic.db ] && rm academic.db

conn = sqlite3.connect("academic.db")
cursor = conn.cursor()

## 18. Write SQL query to Create a table named students with two columns id (integer type) and name (varchar type)

In [23]:
q18a = """
CREATE TABLE students (
  id INTEGER,
  name VARCHAR(255)
);
"""

In [ ]:
def q18_grader_a(q18):
  try:
    cursor.execute(q18)
    return True
  except:
    pass

def q18_grader_b(q19):
  result = pd.read_sql_query(q19, conn)
  return result.columns.tolist() == ['id', 'name']

q18b = """SELECT * FROM students;"""

print(q18_grader_a(q18a) and q18_grader_b(q18b))

True

## 19. Write SQL query to insert the values (1, 'Alice') into students table

In [24]:
q19_a = "INSERT INTO students (id, name) VALUES (1, 'Alice');"

In [ ]:
def q19_grader_a(q19_a):
  try:
    cursor.execute(q19_a)
  except:
    pass
  return True

def q19_grader_b(q19_b):
  result = pd.read_sql_query(q19_b, conn)
  return result.values.tolist() == [[1, 'Alice']]

q19_b = "SELECT * FROM students"
print(q19_grader_a(q19_a) and q19_grader_b(q19_b))

True

## 20. Write SQL Query to add the following more information to students table

| ID | Name    |
|----|---------|
| 2  | Bob     |
| 3  | Charlie |

In [25]:
q20 = """
INSERT INTO students (id, name) VALUES
(2, 'Bob'),
(3, 'Charlie');
"""

In [ ]:
def q20_grader(q20):
  try:
    cursor.execute(q20)
  except:
    pass
  return True

def q20_grader_b(q20_b):
  result = pd.read_sql_query(q20_b, conn)
  return result.values.tolist() == [[1, 'Alice'], [2, 'Bob'], [3, 'Charlie']]

print(q20_grader(q20) and q20_grader_b(q19_b))

True

In [ ]:
# conn.close()